<script>
    import Container from "../../components/Container.svelte";
    import Layout from "../../components/Layout.svelte";
</script>

<Layout>
    <Container>
        <div>
            <h1>Правила игры</h1>
            <hr class="titleUnderline" />
        </div>
        <div class="rules">
            <div class="recomendations">
                <h3>Рекомендации перед началом игры</h3>
                <p>
                    <span>Количество игроков:</span> от 10 (при меньшем количестве
                    игра быстро заканчивается).
                </p>
                <p>
                    <span>Цель игры:</span> для мирных людей вычислить и убить мафию,
                    для мафии — перестрелять всех мирных.
                </p>
            </div>
            <div class="roles">
                <h3>Основные роли</h3>
                <nav>
                    <ul>
                        <li>
                            <span>Мафия.</span> Убивает одного из игроков каждую
                            ночь. Цель: оставить "за столом" игроков только с ролью
                            "мафия".
                        </li>
                        <li>
                            <span>Мирный житель.</span> Роль, активная только в дневное
                            время. Способна только исключать голосованием игрока.
                            Цель: исключить всех игроков с ролью "мафии".
                        </li>
                        <li>
                            <span>Коммиссар.</span> Просыпается каждую ночь и выбирает
                            одного из игроков для "проверки". Если выбранный игрок
                            имеет роль "мафии", ведущий показывает жест, подтверждающий
                            это. Цель аналогична мирным жителям - исключить всех
                            "мафий" голосованием.
                        </li>
                    </ul>
                </nav>
            </div>
            <div class="leader">
                <h3>Как вести игру</h3>
                <span>В первую ночь ведущий обьявляет:</span>
                <nav>
                    <ul>
                        <li>Наступает ночь (все игроки закрывают глаза).</li>
                        <li>
                            Мафия просыпается и знакомится (все игроки, которым
                            выпала роль мафии, открывают глаза и запоминают свою
                            «команду»).
                        </li>
                        <li>Мафия засыпает (все закрывают глаза).</li>
                        <li>
                            Наступает утро, все игроки просыпаются (все
                            открывают глаза).
                        </li>
                        <li>
                            Итак, господа, у нас в городе обосновалась МАФИЯ!
                            (речь ведущего).
                        </li>
                    </ul>
                </nav>
                <p style="margin-top: 30px;">
                    Далее игроки на основании легенд и своих догадок, а мафия на
                    основании того, что они друг о друге знают, высказывают
                    мнения о подозрительных личностях. После того, как все
                    высказались, проводится голосование. Тот, за кого
                    проголосовало большинство, считается убитым. Исключенный
                    голосованием игрок выбывает из игры.
                </p>
                <span style="display:block; margin-top: 40px;">
                    Вторая и последующие ночи:
                </span>
                <p>
                    Во вторую и последующие «ночи» сначала просыпается мафия,
                    совещается и показывает ведущему, кого она убивает
                    (несколько мафий выбирают коллективно ОДНУ жертву), затем
                    просыпается комиссар и указывая ведущему на любого игрока
                    спрашивает мафия он или нет. Ведущий отвечает заранее
                    оговоренным жестом.
                </p>
                <p style="margin-top: 30px;">
                    Также сейчас популярна ещё и роль доктора (хотя в своем)
                    изначальном виде данная карточная игра такой роли не
                    предполагала. Доктор также просыпается каждую ночь (начиная
                    со второй) и "лечит" одного из игроков. Если мафия и доктор
                    указали на одного и того же игрока, то данный игрок
                    выживает. Доктор может излечить и себя, но не каждую ночь
                    подряд (иначе доктор будет неуязвим и игру невозможно будет
                    выиграть за мафию).
                </p>
            </div>
            <div class="goal">
                <span style="display:block; margin-top: 40px;">
                    Окончание игры:
                </span>
                <p>
                    В классическом варианте игра заканчивается одним из двух
                    вариантов событий:
                </p>
                <nav>
                    <ul>
                        <li>
                            Мирные игроки исключили всех игроков с ролью
                            "мафия". Таким образом объявляется победа мирных.
                        </li>
                        <li>
                            Мафия убила (или исключила голосованием) всех
                            игроков с любой ролью не мафии. Тем самым
                            объявляется победа мафии (даже если "за столом"
                            находятся не все игроки с ролью мафии).
                        </li>
                    </ul>
                </nav>
            </div>
            <div class="additionalRoles">
                <span style="display:block; margin-top: 40px;">
                    Дополнительные роли:
                </span>
                <p>
                    Если игроков "за столом" собралось более 12, чаще всего
                    добавляют роли в раздачу из следующего набора:
                </p>
                <nav>
                    <ul>
                        <li>
                            <span>Дон мафии.</span> Роль в помощь для мафии. Просыпается
                            ночью и проверяет одного из игроков, является ли тот
                            комиссаром.
                        </li>
                        <li>
                            <span>Маньяк.</span> Играет "сам за себя". Просыпается
                            ночью (НЕ одновременно с мафией) и убивает одного из
                            игроков. Цель: остаться единственным игроком "за столом".
                        </li>
                        <li>
                            <span>Путана (Проститутка).</span> Просыпается ночью
                            и "ходит" к одному из игроков. Днём игрока, к которому
                            "сходила" путана нельзя исключить голосованием.
                        </li>
                        <li>
                            <span>Босс.</span> Главный среди мафиози. Просыпается
                            каждую ночь и убивает одного из игроков (если мафиози
                            выбрали другого игрока, их выбор не учитывается).
                        </li>
                        <li>
                            <span>Якудза.</span> Задача: истребить мирных жителей
                            и мафию. Просыпается каждую ночь. В первую ночь договаривается
                            об убийствах, а начиная со второй стреляет.
                        </li>
                        <li>
                            <span>Вор.</span> Играет за мирных жителей. Просыпается
                            первым и лишает спецдействия одного из игроков. Таким
                            образом игрок не может совершить действие ночью.
                        </li>
                    </ul>
                </nav>
            </div>
        </div>
    </Container>
</Layout>

<style>
    .titleUnderline {
        margin-bottom: 0;
    }
    .rules h3 {
        margin-top: 30px;
        margin-bottom: 15px;
        font-size: 1.4rem;
    }
    .rules p {
        font-size: 1.1rem;
        margin: 10px 0;
    }
    .rules span {
        font-size: 1.2rem;
        font-weight: 700;
    }
    .rules nav {
        margin-top: 10px;
    }
    .rules nav li {
        font-size: 1.1rem;
        list-style-type: none;
        margin-bottom: 15px;
    }
    .rules nav li::before {
        list-style-type: none;
        content: "●";
        margin-right: 10px;
    }
</style>
