<div class="instruction">
    <h2>Как раздать карты</h2>
    <hr />
    <p>
        Для раздачи карт в приложении существует два способа:
        <a href="#automode" class="link m-10">1. Автоматический. </a>
        <a href="#manualmode" class="link m-10">2. Ручной. </a>
        Для выбора режима сделайте свайп вправо по экрану для вызова меню и выберите
        пункт "Раздать карты".
    </p>
    <p>
        Если вы уже сформировали карты для выдачи, но не знаете как выдавать их
        игрокам, <a href="#distribution" class="link">нажмите сюда.</a>
    </p>
    <h3 id="automode">Автоматический режим</h3>
    <aside class="mt-20 mb-10">
        ВАЖНО!!! <br />
    </aside>
    В автоматическом режиме система может раздать роли только следующего типа:
    <nav>
        <ul>
            <li>Мафия</li>
            <li>Дон мафии</li>
            <li>Мирный житель</li>
            <li>Коммиссар</li>
            <li>Доктор</li>
        </ul>
    </nav>
    <aside class="mt-20 mb-10">
        Формирование колоды <br />
    </aside>
    <p>
        1. В автоматическом режиме система предлагает вам ввести количество
        игроков, который присутствуют на данный момент. <br />Далее, после ввода
        игроков вам будет предложен набор карт, которые система предлагает для
        выдачи.
    </p>
    <p>
        2. Если вам не нравится предложенная системой колода, можете заменить её
        нажать на кнопку "Изменить раздачу".
    </p>
    <p>
        3. После выбора всех ролей игроков нажмите на кнопку "Подтвердить" (или
        "Раздать").
    </p>
    <p>
        4. Перед вами откроется окно предпросмотра всех выбранных ролей и их
        количества в колоде.
    </p>
    <p>
        5. Если вас устраивает текущий список ролей, нажмите на кнопку
        "Раздать".
    </p>
    <p>
        Для того, чтобы посмотреть, как раздавать карты непосредственно после
        выбора ролей, <a href="#distribution" class="link">нажмите сюда.</a>
    </p>

    <h3 id="manualmode">Ручной режим</h3>
    <aside class="mt-20 mb-10">
        Формирование колоды <br />
    </aside>
    <p>
        0. В ручном режиме вам самому необходимо выбрать роли всех игроков,
        которые будете раздавать далее.
    </p>
    <p>
        1. Для выбора роли (после того как в меню выбора типа раздачи вы
        кликнули на кнопку "Ручной"), перед вами показывается интерфейс выбора
        ролей.
    </p>
    <p>
        2. Чтобы добавить роль (например роль - "Мафия") в колоду для раздачи,
        кликните на кнопку "+" рядом с ролью с нужным названием. Соответственно
        чтобы удалить карту из раздачи, кликните на кнопку "-" рядом с ролью с
        нужным названием.
    </p>
    <p>
        2.1. Количество карт в колоде для каждой роли отображается цифрой между
        кнопок "+" и "-". Каждой роли можно добавить от 0 до 100 карт.
    </p>
    <p>
        2.2. Если вам необходимо добавить сразу много ролей (или убрать сразу
        много), кликните на цифру между кнопок "+" и "-". Откроется клавиатура,
        где количество карт можно ввести вручную.
    </p>
    <p>
        2.3. Суммарное количество всех карт можно посмотреть снизу экрана в
        графе "Количество игроков".
    </p>
    <p>3. После выбора нужных ролей нажмите на кнопку "Подтвердить".</p>
    <p>
        4. Для того, чтобы посмотреть, как раздавать карты непосредственно после
        выбора ролей, <a href="#distribution" class="link">нажмите сюда.</a>
    </p>
    <h3 id="distribution">Раздача карт игрокам</h3>
    <p>
        После того, как вы сформировали все роли в ручном или автоматическом
        режиме, настало время раздать все карты игрокам.
    </p>
    <aside class="mt-20 mb-10">Раздача карт</aside>
    <p>1. Перед выдачей ролей вы должны "отправить в ночь" всех игроков.</p>
    <p>
        2. Далее вы пробуждаете одного игрока и даёте ему ваше устройство, где
        показывается "рубашка" карты. Игрок должен кликнуть на "рубашку" и она
        повернётся другой стороной, где показывается его ролью.
    </p>
    <p>
        3. После того, как игрок увидел свою роль, он должен либо повторно
        кликнуть на карту, чтобы она скрылась, либо дождаться истечения таймера
        на скрытие (режим скрытия карт можно изменить в настройках приложения).
    </p>
    <p>
        4. Когда игрок увидел свою роль и карта скрылась, он должен заснуть.
        Пробудите другого игрока и повторите процедуру выдачи, пока игроков без
        роли не останется.
    </p>
    <aside class="mt-20 mb-10">ВАЖНО №1!!!</aside>
    <p>
        Если вдруг игрок не успел посмотреть на свою роль или забыл, вы можете
        вернуть последнюю вскрытую карту обратно на выдачу, свайпнув вправо для
        вызова меню и выбрав там пункт "Вернуть прошлую карту в ротацию".
    </p>
    <aside class="mt-20 mb-10">ВАЖНО №2!!!</aside>
    <p>
        Существует два способа, которыми вы можете показывать карты игрокам: по
        клику или по истечению таймера. <br />Для выбора соответствующего режима
        перейдите в настройки (вызвав меню по свайпу вправо) и выберите нужный
        режим в пункте "Скрытие карт во время выдачи".
    </p>
    <p>
        Для того, чтобы узнать о каждом режиме подробнее, перейдите в пункт
        "Описание настроек приложения", в разделе "Помощь".
    </p>
</div>

<style>
    .instruction {
        overflow-y: auto;
    }
</style>
