<div class="instruction">
    <h2>Как раздать карты</h2>
    <hr />
    <p>
        Для раздачи карт в приложении существует два способа:
        <span>1. Автоматический. </span>
        <span>2. Ручной. </span>
        Для выбора режима сделайте свайп вправо по экрану для вызова меню и выберите
        пункт "Раздать карты".
    </p>
    <h3>Автоматический режим</h3>
    <p>
        1. В автоматическом режиме система предлагает вам ввести количество
        игроков, который присутствуют на данный момент. Далее, после ввода
        игроков вам будет предложен набор карт, которые система предлагает для
        выдачи.
    </p>
    <p>
        2. Если вам не нравится предложенная системой колода, можете заменить её
        нажать на кнопку "Изменить раздачу".
    </p>
    <p>
        3. После выбора всех ролей игроков нажмите на кнопку "Подтвердить" (или
        "Раздать").
    </p>
    <p>
        4. Перед вами откроется окно предпросмотра всех выбранных ролей и их
        количества в колоде.
    </p>
    <p>
        5. Если вас устраивает текущий список ролей, нажмите на кнопку
        "Раздать".
    </p>
</div>

<style>
    .instruction {
        overflow-y: auto;
    }
    hr {
        margin: 10px 0;
        height: 3px;
        background: #eeeef5;
        color: #eeeef5;
        border-radius: 5px;
        max-width: 30%;
    }
    span {
        font-weight: 600;
        display: block;
        margin: 10px 0;
    }
    h3 {
        margin-top: 30px;
        margin-bottom: 10px;
    }
    p {
        margin-bottom: 5px;
    }
</style>
