<div class="instruction">
    <h2>История игр</h2>
    <hr />
    <p>
        Чтобы посмотреть историю всех предыдущих игр, свайпните вправо для
        вызова меню и выберите пункт "История игр".
    </p>
    <p>
        Перед вами будут отображены последние 100 игр, для которых ранее
        производилась раздача карт. (Даже если раздача не завершена до конца)
    </p>
    <p>
        Игры отсортированы по дате от самой последней сыгранной, к самой старой.
    </p>
    <h3>Инфо о раздаче</h3>
    <p>
        0. Для каждой раздачи система сохраняет все выданные и не выданные (если
        раздача не закончилась) карты, присутствовавшие в колоде.
    </p>
    <p>
        1. Чтобы посмотреть историю конкретной раздачи, кликните на кнопку
        "Подробнее" для нужной игры.
    </p>
    <p>
        2. Перед вами отобразится всплывающее окно со всеми картами, которые
        присутствовали в колоде.
    </p>
    <p>
        3. Все выданные и не выданные карты отсортированы по новизне, то есть,
        например самой первой картой в списке "вскрытых" будет та, которая была
        вскрыта раньше всех. Для не вскрытых карт сортировка аналогична.
    </p>
</div>

<style>
    .instruction {
        overflow-y: auto;
    }
</style>
