<div class="instruction">
    <h2>Описание настроек приложения</h2>
    <hr />
    <p>
        У приложения присутствуют несколько различных настроек. Для их изменения
        свайпните по экрану вправо, чтобы вызвать меню и выберите там пункт
        "Настройки".
    </p>
    <p>Кликните на нужную настройку ниже, чтобы прочитать о ней подробнее.</p>
    В автоматическом режиме система может раздать роли только следующего типа:
    <nav>
        <ul>
            <li><a href="#deathZone" class="link">Мертвая зона свайпов</a></li>
            <li>
                <a href="#distributionType" class="link"
                    >Скрытие карт во время выдачи</a
                >
            </li>
            <li>
                <a href="#disableAnimations" class="link">Отключение анимаций</a
                >
            </li>
            <li>
                <a href="#viewRolesInfo" class="link"
                    >Отображение информации о ролях</a
                >
            </li>
            <li>
                <a href="#customRoles" class="link">Пользовательские роли</a>
            </li>
        </ul>
    </nav>
    <h3 id="deathZone">Мертвая зона свайпов</h3>
    <p>
        "Мертвая зона" указывает на то, насколько далеко вы должны проводить
        пальцем по экрану, чтобы вызвать\скрыть меню (значение указывается в
        процентах от ширины вашего экрана)
    </p>
    <p>
        Например, если значение "мертвой зоны" у вас стоит как 25, это означает,
        что пока вы не проведёте пальцем больше чем 25% ширины экрана, меню НЕ
        будет вызвано/скрыто.
    </p>
    <h3 id="distributionType">Скрытие карт во время выдачи</h3>
    <p>
        Существует два способа, которыми вы можете показывать карты игрокам: по
        клику или по истечению таймера. <br />Для выбора соответствующего режима
        перейдите в настройки (вызвав меню по свайпу вправо) и выберите нужный
        режим в пункте "Скрытие карт во время выдачи".
    </p>
    <p>
        1. В режиме <span>"По клику на карту"</span> для того, чтобы скрыть карту,
        которую игрок увидел, он должен кликнуть по ней ещё раз (после того, как
        открыл).
    </p>
    <p>
        2. В режиме <span>"По истечению таймера"</span> карта скроется от игрока
        автоматически через некоторое время (его можно настроить в соответствующем
        пункте меню настроек).
    </p>
    <h3 id="disableAnimations">Отключение анимаций</h3>
    <p>
        Эта настройка позволяет отключить отображение большинства анимаций и
        переходов в приложении.
    </p>
    <p>
        Если у вас слабое устройство, включение данной опции позволит получить
        существенный прирост скорости работы приложения.
    </p>
    <h3 id="viewRolesInfo">Отображение информации о ролях</h3>
    <p>
        Эта настройка позволяет показать или скрыть информацию о ролях во время
        того, как они будут выдаваться игрокам.
    </p>
    <p>
        Можно скрыть описание к ролям а также их иконки, нажав на
        соответствующие пункты меню.
    </p>
    <h3 id="customRoles">Пользовательские роли</h3>
    <p>
        В данной настройке вы можете сконфигурировать те роли, которые сами
        добавили в приложение через кнопку "Добавить свою роль".
    </p>
    <p>
        1. Вы можете удалить роль, кликнув на соответствующую кнопку. Обратите
        внимание, если вы удаляете роль, раздачи для которой имеются в истории
        игр, удалённые роли будут помечены названием "Неизвестная роль".
    </p>
    <p>
        2. Можно изменить описание к роли. Оно будет показываться игрокам во
        время выдачи роли.
    </p>
    <p>
        3. Можно изменить иконку к роли. Изначально при создании
        пользовательской роли на неё будет "повешена" стандартная иконка,
        которую предоставляет приложение, но вы можете заменить её на любую
        другую, кликнув на соответствующую кнопку.
    </p>
</div>

<style>
    .instruction {
        overflow-y: auto;
    }
</style>
